<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 TRANSITIONAL//EN">
<html>
<head>
    <link rel="stylesheet" href="/estilo.css" type="text/css">
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="IgorTamara">
   <title>Aún más de Igor Támara</title>
</head>
<body class="mas">
<div align="center"><a href="mapa.html"><img src="images/mapa.png" border="0" alt="Mapa del Sitio"></a></div>
<h1>Aún más de Igor Támara</h1>

<p>Aún leyendo de lo que me gusta? Eso quiere decir que está listo
para leer otro poco, aquí va:<!-- pertenezco a Los <a
href="http://multifleo.tripod.com" TARGET="_blank">Leos</a> -->Soy
ingeniero  de sistemas y matem&aacute;tico de La Universidad de Los
<a href="http://www.uniandes.edu.co" TARGET="_blank">Andes</a>,
actualmente estoy trabajando en la <a
href="http://www.funtamarapatino.org">Fundación Támara Patiño</a>.
encargada de la administración del <a
href="http://www.gfc.edu.co">Gimnasio Fidel Cano</a>,  en el <a
href="http://www.gfc.edu.co">Gimnasio Fidel Cano</a>, asesorando en
migraciones y programando aplicaciones para el web.

<p> En <a href="http://math.uniandes.edu.co" TARGET="_blank">matem&aacute;ticas</a> me interesa todo lo nuevo que pueda aprender, es la carrera a la cual ingres&eacute;. Cada vez que uno profundiza m&aacute;s ah&iacute;, ve que la gente est&aacute; progresando en cada una de sus ramas. (Siendo honesto, hace tiempo que no le dedico tiempo a matemáticas, dado que me estoy desempeñando profesionalmente en la otra) Posteriormente ingres&eacute; a estudiar Ingenier&iacute;a, y vaya sorpresa, termin&eacute; primero la que comenc&eacute; despu&eacute;s.

<p>Si quiere conocer algo de mi tesis de Ingenier&iacute;a de Sistemas, la cual tiene como tema An&aacute;lisis de Lenguaje Natural, visite <a href="http://cero.uniandes.edu.co/~igor/plena">PLeNa</a>. Si por alg&uacute;n motivo no est&aacute; funcionando correctamente, env&iacute;eme un <a href="mailto:igor@tamarapatino.org">correo</a>. El documento de la misma lo hice empleando <a href="ftp://ftp.tex.ac.uk" TARGET="_blank">LaTeX</a>, el cual sirve para escribir Matem&aacute;ticas bonitas, adem&aacute;s de tener un mont&oacute;n de aplicaciones que se han desarrollado alrededor del mundo que lo hacen muy portable, ejemplo de esto es LaTeX2HTML. El sistema operativo bajo el cual hice todo el desarrollo de la misma fue <a href="http://www.gnu.org/philosophy/why-gnu-linux.es.html" TARGET="_blank">Linux</a>,
impresionante sistema operativo, mi distribuci&oacute;n favorita es <a href="http://www.debian.org">Debian</a>, el lenguaje utilizado fue <a href="http://java.sun.com" TARGET="_blank">Java</a> para tratar de garantizar la portabilidad, y la persistencia de la informaci&oacute;n la hice con <a href="http://www.postgresql.org">PostGreSQL</a> (Una base de datos poderosa y libre).  Todo lo que emple&eacute; es gratis y usted también puede emplearlo.

<p>La tesis de matemáticas la desarrollé empleando únicamente herramientas libres, <a href="http://www-rocq.inria.fr/modulef">Modulef</a> fue la central, una biblioteca y conjunto de aplicaciones para hacer cálculos de elementos finitos.  Si quiere, puede colaborar en el desarrollo, ya lleva más de 20 años de desarrollo. Nació en Francia y es utilizada en ámbitos académicos sobre todo.

<p>Mantengo un <a
href="http://wiki.freaks-unidos.net/weblogs/ikks">weblog</a> donde
coloco algo de lo que pienso o eventualmente algo técnico.

<p>En realidad un curriculum vitae concebido dentro
de nuestro capitalismo deber&iacute;a ser la informaci&oacute;n de lo que
he hecho, eso est&aacute; en este <a href="http://www.tamarapatino.com/quienes.shtml">sitio</a>,lo que m&aacute;s me interesa es <b>ser persona</b>, si quiere saber a que me refiero, escriba<a href="mailto:igor@tamarapatino.org">me</a>,
e intentar&eacute; mostrarle lo que pienso en este aspecto, de pronto usted
es uno de los que comparten mi opini&oacute;n.

<p>Con un hijo en este momento :)

<p>También trabajo como voluntario en <a href="http://structio.sourceforge.net">Structio</a> para tratar de mejorar la educación en Colombia y estoy involucrado en la comunidad <a href="http://www.slec.net">SLEC</a>(Software Libre y Educación en Colombia).

<p>Finalmente, términos como geek o nerd eventualmente pueden ser aplicados a mí, esencialmente el sentido interesante de tales palabras lo tomo y transformo el resto.  Esto no quiere decir que me llamen así por ahí.  Algún día si sigo juicioso trabajando podría ser un hacker.  <font size="+3">¡OJO!</font>, no confunda el término hacker con cracker.  Erick Raymond hizo un <a href="http://tuxedo.org/~esr/faqs/hacker-howto.html">escrito</a> muy interesante que le ayudará a entender qué significa exactamente tal término.  

<p>Una mala interpretación ha sido difundida por ciertas personas y compañías para desacreditar las fuentes abiertas en el software y para confundir el público general. Un aporte en la campaña para llamar a cada cuál de acuerdo a lo que hace, es el siguiente <a href="escritos/hackersycrackers">escrito</a>.

<p>Algo más, muchas personas hablan de software libre, pero la mejor
forma para medir, creo que sería <b>show me the code</b>, si está
buscando a alguien que realmente pueda dar crédito del software
libre, <a href="http://www.google.com">busque un poco</a> para ver
si ha contribuido de las siguintes formas en orden de relevancia, el
primero, el más importante:
<ol>
<li>Código fuente que ha liberado u ofrecido</li>
<li>Documentación escrita como manuales, tutoriales y escritos para
enseñar a otros.</li>
<li>Aportes reales a comunidades</li>
<li>Migración y trabajo voluntario</li>
<li>Uso diario de software libre</li>
</ol>
<div align="center">[<a href="recursos.html">Recursos</a>][<a href="index.html">Principal</a>][<a href="escritos/">Escritos</a>][<a href="apoyo.html">Campañas</a>]</div>
</body>
</html>
